[
  {
    "id": 1,
    "org": "TAFE QLD",
    "position": "Frontend and backend web development",
    "type": "study",
    "started_at": "2023-10-16",
    "ended_at": "2025-02-25",
    "description": "Completed a comprehensive program that enhances my expertise in modern web technologies, full-stack architecture, and project-based software development. Gained hands-on experience with frontend frameworks, backend services, and deployment practices aligned with industry standards.",
    "desc_array": null,
    "location": "Gold Coast, QLD"
  },
  {
    "id": 2,
    "org": "Austech Saw & Tooling",
    "position": "Digital System Officer",
    "type": "work",
    "started_at": "2021-06-21",
    "ended_at": "2023-07-11",
    "description": "",
    "desc_array": [
      "Maintained and enhanced company B2B websites, with a focus on updating frontend code and implementing UI improvements.",
      "Worked with Pronto ERP for operational tasks, including data analysis and reporting using Pronto Cognos.",
      "Developed internal tools and workflow automation using Microsoft PowerApps and Power Automate, improving process efficiency; Created and maintained SharePoint-based knowledge management systems to streamline internal documentation and information sharing."
    ],
    "location": "Gold Coast, QLD"
  },
  {
    "id": 3,
    "org": "La Trobe University",
    "position": "Master of Business Information Management and Systems",
    "type": "study",
    "started_at": "2018-06-22",
    "ended_at": "2020-09-11",
    "description": "Developed a strong foundation in business processes, systems analysis, and database management. Gained essential skills in bridging the gap between technology and business needs through data-driven systems and digital solutions.",
    "desc_array": null,
    "location": "Melbourne, VIC"
  },
  {
    "id": 4,
    "org": "Reddot Electronics",
    "position": "Digital System Developer",
    "type": "work",
    "started_at": "2011-08-28",
    "ended_at": "2018-01-01",
    "description": "",
    "desc_array": [
      "Designed, developed, and managed the business WordPress website, customising themes and regularly updating content.",
      "Designed and implemented database schemas for order and customer management systems, ensuring data consistency and scalability.",
      "Built and customised Zoho Creator applications using Deluge scripts, implementing complex business logic to streamline company processes."
    ],
    "location": "Shanghai, China"
  },
  {
    "id": 5,
    "org": "Shandong Agricultural University",
    "position": "Bachelor of Science in Economics",
    "type": "study",
    "started_at": "2009-09-11",
    "ended_at": "2011-06-28",
    "description": "Completed foundational studies in microeconomics, macroeconomics, and international trade. Developed analytical thinking and problem-solving skills applicable to both business and technology environments.",
    "desc_array": null,
    "location": "Qingdao, China"
  }
]
